[
  {
    "path": "posts/2022-07-19-geado/",
    "title": "Guidance for Ecological Impact Assessment of Desalination Operations, City of Santa Barbara Water Resources (2021)",
    "description": "Some GIS work for my internship with the City of Santa Barbara, providing guidance for developing an ecological impact assessment for the Charles E. Meyer desalination facility.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2022-07-19",
    "categories": [],
    "contents": "\r\nOver the summer of 2021, I worked on a three member research team to\r\nconduct a comprehensive study of methodologies to assess the ecological\r\nimpact of the Charles E. Meyer desalination facility on the local marine\r\nenvironment. The facility has a unique position within the current\r\nregulatory environment. These special circumstances made it necessary to\r\nresearch several alternate methods of assessment.\r\nThe team wrote a 70 page report detailing various methods and\r\nprovided information regarding the physical and biological\r\ncharacteristics offshore from the desal plant. As the primary GIS\r\nspecialist on the team, I produced many of the maps that were provided.\r\nSeveral examples are provided below in Figures 1-7.\r\nFigure 1: GIS map of Charles E. Meyer\r\nDesalination Facility, the facility’s intake line, and the facility’s\r\noutfall line, in relation to Highway 101.Figure 2: GIS map of Charles E. Meyer\r\nDesalination Facility, the facility’s intake line and the facility’s\r\noutfall line with diffuser zone. This figure shows the extent of the\r\nintake and outfall lines in the Santa Barbara Channel.Figure 3: Sea floor substrate\r\ncharacteristics of the Santa Barbara Channel in and around the Charles\r\nMeyer Desalination Facility’s intake and outfall lines.Figure 4: Sea floor substrate\r\ncharacteristics of the Santa Barbara Channel and the Charles Meyer\r\nDesalination Facility’s intake and outfall lines in relation to Camby’s\r\nReef (represented by a turquoise pentagon) and One-Mile Reef\r\n(represented by an orange pentagon).Figure 5: Map of the Santa Barbara\r\nChannel’s offshore habitats in relation to the Charles Meyer\r\nDesalination Facility’s intake and outfall lines.Figure 6: Map of 2013 Southern California\r\nBight Regional Monitoring Program fish trawl sampling stations,\r\nestablished by the Southern California Coastal Water Research Project\r\n(SCCWRP). The stations are shown in relation to the Charles Meyer\r\nDesalination Facility intake and outfall lines.Figure 7: Map of the Marine Protected\r\nArea network across the Santa Barbara Channel shown in relation to the\r\nCharles Meyer Desalination Facility.\r\n\r\n\r\n",
    "preview": "posts/2022-07-19-geado/Figure2-3.jpg",
    "last_modified": "2022-07-19T13:48:27-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-19-goletaslough/",
    "title": "Belding's Savannah Sparrow Conservation in Goleta Slough (Bren, 2021)",
    "description": "This conservation planning capstone project quantified the impacts of sea level rise on Belding's Savannah Sparrow habitat in Goleta Slough using Sea Level Affecting Marshes Model (SLAMM).",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2022-07-19",
    "categories": [],
    "contents": "\r\nAt UCSB’s Bren School of Environmental Science & Management, my\r\nmasters specialization was conservation planning, which provided highly\r\ntechnical training in “strategies and tactics for achieving conservation\r\ngoals and objectives for specific resources and areas of interest” (Bren\r\nwebsite). The specialization coursework focused on ecological inventory\r\nand monitoring, data analysis, mapping, and modeling, in addition to\r\npolicy, land and water use planning, and economics.\r\nAn additional requirement of the specialization was a capstone\r\n“practicum” project approved by faculty. For this project, my partner\r\nand I developed an assessment of potential sea level rise impacts on the\r\nBelding’s Savannah Sparrow in Goleta Slough in Goleta, CA.\r\nBelding’s Savannah Sparrow (Figure 1) is a State of California-listed\r\nendangered subspecies of the Savannah Sparrow that is highly dependent\r\non saltmarsh habitat, particularly dense patches of Salicornia\r\n(pickleweed). The south coast of Santa Barbara County is the northern\r\nextent of the sparrow’s range. Because Goleta slough is managed for\r\nmultiple objectives–it contains a municipal airport, gas company\r\nfacilities, and Goleta Sanitary District facilities–the\r\necological/biodiversity importance of the slough is somewhat at odds\r\nwith the wider urban context.\r\nFigure 1: Belding’s Savannah Sparrow\r\n(Wikipedia).Our project sought to explore the risk of sea level rise to\r\nSalicornia and Belding’s Savannah Sparrow habitat in the slough, which\r\nhas already been severely reduced due to urban development. To\r\naccomplish this, we used the Sea Level Affecting Marshes Model (SLAMM),\r\na GIS program developed by Warren Pinnacle Consulting with funding from\r\nThe Nature Conservancy and the US EPA.\r\nInputs for SLAMM\r\nSLAMM uses raster inputs including slope, a digital elevation model,\r\nand a National Wetlands Inventory (NWI) classification, and physical\r\nparameters such as accretion rate, salt line, mean tide line, and sea\r\nlevel rise scenario to simulate dynamic effects of sea level rise on\r\nmarshes over a user-defined time period.\r\nTo build the inputs, we first used ArcGIS Pro to georeference a PDF\r\nof planning documents for the Santa Barbara airport, which included a\r\nvegetation survey of the slough (Figure 2).\r\nFigure 2: Georeferenced vegetation survey\r\nfrom airport planning documents.Next, we used ArcGIS Pro’s unsupervised machine learning image\r\nclassification to segment the georeferenced image and then merged the\r\nresulting polygons together to form a vegetation layer that included\r\ndelineation of existing Salicornia patches. We overlaid a National\r\nWetlands Inventory over this to develop our NWI layer (Figure 3).\r\nFigure 3: NWI classification\r\nlayer.Finally, we created a digital elevation model and slope layer using\r\nUSGS 3DEP data (Figure 4). These were also used as inputs for SLAMM.\r\nFigure 4: Slope layer.Running SLAMM\r\nWith all the GIS inputs set up, we used tidal data from NOAA gauges\r\nand slough characteristics from literature to parameterize the physical\r\nproperties of the simulation. We made some assumptions, including our\r\naccretion rate values. Because of the uncertainty around accretion rate,\r\nwhich is subject to variance from several factors including upstream\r\nerosion, we decided to run the simulation twice: once using an accretion\r\nrate of 1 mm per year and again for an accretion rate of 5 mm per year.\r\nAccording to literature we found, this reflects either end of a likely\r\nrange predicted by experts.\r\nWe ran each simulation until the year 2100 under a sea level rise\r\nscenario of 1 meter rise by the year 2100. The results for the 1 mm\r\naccretion rate are shown in Figure 5. Results for the 5 mm accretion\r\nrate are shown in Figure 6.\r\nFigure 5: Results using simulated 1 mm\r\naccretion rate and 1 meter of sea level rise by the year\r\n2100.Figure 6: Results using simulated 5 mm\r\naccretion rate and 1 meter of sea level rise by the year\r\n2100.By overlaying these layers over our original vegetation layer and\r\nusing map algebra, we were able to determine the amount of Salicornia\r\nhabitat area lost or gained under both accretion scenarios. Figure 7\r\nshows a map of the Salicornia habitat area lost or gained considering a\r\n1 mm accretion rate. Figure 8 shows the same considering a 5 mm\r\naccretion rate.\r\nFigure 7: Salicornia habitat lost and\r\ngained under the 1 mm accretion rate simulation.Figure 8: Salicornia habitat lost and\r\ngained under the 5 mm accretion rate simulation.\r\n\r\n\r\n",
    "preview": "posts/2022-07-19-goletaslough/RESULTS_1mm.png",
    "last_modified": "2022-07-19T12:20:38-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-18-drone/",
    "title": "Remote Aerial Imagery using Drones (Palomar College, 2019)",
    "description": "For this project, I stitched together drone images I collected to create a photogrammetric digital surface model and orthomap of the old facilities department at Palomar College.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2022-07-18",
    "categories": [],
    "contents": "\r\nWhile at Palomar College, I took coursework in small unmanned aerial\r\nsystems (sUAS). These courses taught me to become a remote pilot and how\r\nto use software (Metashape) to create orthoimage maps and aerial\r\nphotogrammetry with drones.\r\nFor one project, my partner and I flew a mission over the old\r\nfacilities department buildings on the Palomar College campus. I then\r\nused Metashape to create an orthoimage (Figure 1) and 3D mesh, which\r\nwere then converted into a digital surface model of the buildings and\r\nsurrounding area (Figure 2).\r\nFigure 1: Orthoimage of the old\r\nfacilities department on the Palomar College campus.Figure 2: Digital Elevation (Surface)\r\nModel of the old facilities department on the Palomar College\r\ncampus.\r\n\r\n\r\n",
    "preview": "posts/2022-07-18-drone/04-11-19_oldfacil_dem.png",
    "last_modified": "2022-07-18T22:39:51-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-18-sanelijo/",
    "title": " Visualizing Flood Inundation Due to Sea Level Rise in the San Elijo Lagoon Using GIS (Palomar College, 2019)",
    "description": "A 'bathtub model' analysis of San Elijo lagoon using LiDAR point cloud data.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2022-07-18",
    "categories": [],
    "contents": "\r\nFor my GIS associate degree capstone project at Palomar Community\r\nCollege, I performed a ‘bathtub model’ analysis of San Elijo lagoon to\r\nvisualize the impact of projected sea level rise. First, I used esri\r\nArcGIS Pro to generate a high resolution (1.5 feet) digital surface\r\nmodel from USGS LiDAR point-cloud data (Figure 1). The digital surface\r\nmodel required some data cleaning and gap filling, which was\r\naccomplished through manual and automatic interpolation.\r\nFigure 1: LiDAR Point Cloud data of San\r\nElijo lagoon (USGS 3DEP program, 2019)Next, I used Map Algebra expressions to generate new rasters from the\r\ndigital surface model showing areas of the lagoon where the elevation\r\nwas below a one, two, three, and four foot rise in local mean sea level\r\n(MSL), recorded from a NOAA tidal guage off the coast of nearby La\r\nJolla, CA.\r\nI produced several maps and a final report for this project. Figure 2\r\nshows an amalgamation of these maps, visualizing potential inundation\r\nimpacts of one, two, three, and four feet increases in mean sea\r\nlevel.\r\nFigure 2: Amalgamation of 1-4 feet\r\nincreases in mean sea level and potential inundation impacts to San\r\nElijo LagoonI also had the opportunity to present the project as a poster at the\r\n26th National Advanced Technological Education (ATE) Principal\r\nInvestigators’ Conference in Washington, D.C. as a representative for\r\nPalomar College (Figure 3).\r\nFigure 3: Poster from the 26th National\r\nAdvanced Technological Education Principal Investigators’ Conference\r\n(2019)The project used Mean Sea Level (MSL) for baseline sea level as\r\nopposed to the Mean High High Water (MHHW) and did not account for\r\npotential storm surges. It also did not account for future changes to\r\nthe lagoon from construction and mitigation or from natural processes\r\nsuch as accretion.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-07-18-sanelijo/1-4_foot_2.jpg",
    "last_modified": "2022-07-19T09:39:38-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-18-songs/",
    "title": "Work from San Onofre Nuclear Generating Station Mitigation Monitoring Program (2019-2020)",
    "description": "A selection of GIS projects completed during my contract at SONGS MMP.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2022-07-18",
    "categories": [],
    "contents": "\r\nBetween September, 2019 and April, 2020, I worked as a wetlands field\r\nand lab assistant at the San Onofre Nuclear Generating Station\r\nMitigation Monitoring Program (SONGS MMP). The SONGS program is\r\nadministered through UC Santa Barbara’s Marine Science Institute and\r\nconducts independent, long-term monitoring and evaluation of San\r\nDieguito Lagoon and three reference sites. The program is a condition of\r\nthe coastal development permit issued to Southern California Edison by\r\nthe California Coastal Commission for the operation of SONGS Units 2 and\r\n3. Part of my work there was GIS-oriented and I received additional\r\ncredits towards my associate degree in GIS at Palomar College through\r\nthese GIS project.\r\nAll images used with permission from SONGS MMP.\r\nMachine Learning\r\nClassification\r\nOne of the GIS projects I completed for SONGS MMP was piloting a\r\nvalidation methodology for the project’s vegetative coverage standard.\r\nIn order for Southern California Edison to receive mitigation credit for\r\nwetlands restoration, a certain percentage of the San Dieguito Lagoon\r\nproject area must be covered by wetland vegetation. This is assessed by\r\na large, third-party company that uses aerial imaging and multi-spectral\r\nsensors. However, the principal investigators wanted to find a way to\r\nvalidate the results in-house.\r\nI spent several weeks training esri ArcGIS Pro’s supervised machine\r\nlearning image classification software on multi-spectral drone imagery\r\nin San Dieguito Lagoon to classify vegetation in the lagoon. Figure 1\r\nshows the drone imagery, while figure 2 shows the classification\r\nresults.\r\nFigure 1: Multi-spectral drone imagery of\r\nstudy areas. Areas in red show near-infrared reflectance where\r\nvegetation is present.Figure 2: Rasters of vegetated and\r\nun-vegetated areas classified by supervised machine learning. Green\r\nshows areas where vegetation is present, brown shows areas where\r\nvegetation is not present.I developed the methodology workflow and file organization schema for\r\nthe validation process. However, because the imagery was not of great\r\nquality due to conditions on the day of the drone flight, we were not\r\ncompletely confident with the results.\r\nGrid Classification\r\nAnother GIS project I completed at SONGS MMP was converting the raw\r\nvegetative coverage results from the aforementioned remote sensing\r\ncompany into a gridded format used by the principle investigators to\r\ndetermine whether project standards were met. The results are shown in\r\nfigure 3.\r\nFigure 3: Binned results of vegetation\r\ncoverage in 10 x 10 meter gridded format. To be assessed as salt marsh\r\nhabitat, cover of vegetation must be at least 30% in a grid\r\ncell.Project Mapping\r\nAnother part of the GIS work at SONGS MMP was mapping project\r\nassets–such as air and water quality loggers–using RTK GPS. I also\r\ncreated maps used in project presentations for the scientific advisory\r\npanel and the public. Figure 4 shows one example.\r\nFigure 4: Slide from a SONGS MMP\r\nscientific advisory presentation (02-20-2020) showing map of gridded\r\nvegetation coverage results.\r\n\r\n\r\n",
    "preview": "posts/2022-07-18-songs/SAP.jpg",
    "last_modified": "2022-07-19T09:38:57-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-18-test/",
    "title": "test",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2022-07-18",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing,\r\nnative to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-07-18T16:12:42-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-14-cetacean/",
    "title": "Raster analysis of cetacean species richness off the California Bight",
    "description": "Project completed for an assignment in Allison Horst's ESM 244 class.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2021-03-14",
    "categories": [],
    "contents": "\r\nIntroduction\r\nThis analysis- with associated Rmarkdown file– explores cetacean species richness of the area off the coast of the California Bight. The presence or absence of the 35 species of cetaceans was calculated using a raster of values associated with the probability of occurrence for each species. These values were captured from analysis by Kaschner, et al. and are relative to species-specific environmental suitability based on water temperature, depth, salinity, and distance to land. The extent of the analysis was constrained to 125°W to 115°W and 32°N to 38°N. Data: Kaschner et al. (2016). Aquamaps.org.\r\n\r\n\r\nhide\r\n\r\n#read in data\r\ncetaceans <- list.files(path = here('_posts/2021-03-14-cetacean/data/ca_cetaceans'), full.names = TRUE, pattern = \".tif\")\r\n\r\n#stack the raster files\r\nca_cetaceans <- stack(cetaceans)\r\n\r\n#transform crs\r\nproj4string(ca_cetaceans) <- \"+proj=utm +zone=10 +datum=WGS84 +units=m +no_defs +ellps=WGS84 +towgs84=0,0,0\"\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#create function to reclassify the raster to a binary (threshhold value = 0.6)\r\nis_present <- function(x, thresh = 0.6) {\r\n  y <- ifelse(x >= thresh, 1, 0)\r\n  return(y)\r\n}\r\n\r\n#run function over raster stack\r\ncet_presence <- calc(ca_cetaceans, fun = is_present)\r\n\r\n#plot presence for each species individually\r\n#plot(cet_presence, col = c('red', 'green4'))\r\n\r\n#sum the rasters to reclassify values by richness\r\ncet_density <- calc(cet_presence, fun = sum, na.rm = TRUE)\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#richness raster\r\nplot(cet_density)\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 1: Species richness raster for 35 species of cetaceans off the coast of the California Bight. Threshhold value for presence was set at 0.6 probability of occurrence for each species. Data: Kaschner et al. (2016). Aquamaps.org.\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#download shapefiles\r\ncoast <- ne_download(scale = \"large\", type = 'land', category = 'physical', returnclass = \"sf\")\r\nstates <- ne_download(scale = \"large\", type = 'states', category = 'cultural', returnclass = \"sf\")\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#filter shapefile for CA\r\nca <- states %>% \r\n  filter(name == \"California\")\r\n\r\n#turn raster into a df\r\ncet_density_df <- raster::rasterToPoints(cet_density) %>%\r\n  as.data.frame()\r\n\r\n#create a ggplot map of richness\r\nggplot() +\r\n  geom_raster(data = cet_density_df, aes(x = x, y = y, fill = layer)) +\r\n  scale_fill_distiller(type = \"seq\", palette = \"Blues\", aesthetics = \"fill\", direction = 1) +\r\n  geom_sf(data = coast, fill = \"darkgrey\") +\r\n  geom_sf(data = ca, fill = \"darkgrey\") +\r\n  coord_sf(xlim = c(-125, -115), ylim = c(32,38), expand = FALSE) +\r\n  labs(x = NULL, y = NULL, fill = \"Cetacean Richness\")\r\n\r\n\r\n\r\n\r\nFigure 2: Figure 2: Map of species richness for 35 species of cetaceans off the coast of the California Bight. Threshhold value for presence was set at 0.6 probability of occurence. Data: Kaschner et al. (2016). Aquamaps.org.\r\n\r\n\r\n\r\nData Citations\r\nKaschner, K., Rius-Barile, J., Kesner-Reyes, K., Garilao, C., Kullander, S., Rees, T., & Froese, R. (2016). AquaMaps: Predicted range maps for aquatic species. www.aquamaps.org\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-14-cetacean/cetacean_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2021-03-14T13:31:58-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-14-mono-lake/",
    "title": "A graphical representation of changing water levels in California's Mono Lake, 1850-2017 ",
    "description": "Project completed for an assignment in Allison Horst's ESM 206 class.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2021-03-14",
    "categories": [],
    "contents": "\r\n\r\n\r\nhide\r\n\r\n#read in data\r\nmono_lake <- read.csv(here(\"_posts/2021-03-14-mono-lake/\", \"mono_lake_annual_levels.csv\"), skip = 5) %>% \r\n  clean_names() %>% \r\n  mutate(event = case_when(\r\n    year == 1941 ~ \"1941 - LA DWP begins diverting water\",\r\n    year == 1994 ~ \"1994 - Decision 1631 sets \\nlake level of 6,392 ft \\nto protect Mono Lake\"\r\n  ))\r\n\r\n#reticulating splines\r\nsplines <- as.data.frame(spline(mono_lake$year, mono_lake$lake_level_feet_above_sea_level))\r\n\r\n#visualize data\r\nggplot(data = mono_lake, aes(x = year, y = lake_level_feet_above_sea_level)) +\r\n  geom_line(data = splines, aes(x = x, y = y), size = 1, color = \"royalblue4\") +\r\n  geom_ribbon(data = mono_lake, aes(ymin = -Inf, ymax = lake_level_feet_above_sea_level), fill = \"royalblue\", alpha = .2) +\r\n  geom_ribbon(aes(ymin = 6350, ymax = 6360), fill = \"darkorange\", alpha = .3) +\r\n  geom_ribbon(aes(ymin = -Inf, ymax = 6350), fill = \"darkorange\", alpha = .5) +\r\n  geom_hline(yintercept = 6360, color = \"darkorange\", size = 1, linetype = \"longdash\") +\r\n  annotate(\"text\", x = 1855, y = 6363,\r\n           label = \"6,360 ft - Water salinity above 120 g/L leads to decreased food supply for grebes and gulls\",\r\n           hjust = 0, size = 3, fontface = \"bold\") +\r\n  geom_hline(yintercept = 6377, color = \"goldenrod2\", size = 1) +\r\n  annotate(\"text\", x = 1855, y = 6380,\r\n           label = \"6,377 ft - Emergence of land bridges leads to bird predation at nesting sites\",\r\n           hjust = 0, size = 3, fontface = \"bold\") +\r\n  geom_hline(yintercept = 6350, color = \"darkorange\", size = 1) +\r\n  annotate(\"text\", x = 1855, y = 6353,\r\n           label = \"6,350 ft - Water salinity above 150 g/L leads to acute impacts on food supply for grebes and gulls\",\r\n           hjust = 0, size = 3, fontface = \"bold\") +\r\n  geom_label_repel(aes(label = event),\r\n                   fill = \"white\",\r\n                   size = 3.5,\r\n                   nudge_y = 25) +\r\n  scale_x_continuous(breaks = seq(1850,2017,10), expand = c(0,0)) +\r\n  ylim(6350,6450) +\r\n  labs(x = \"\\nYear\",\r\n       y = \"Lake Level (feet above sea level)\\n\") +\r\n  theme_minimal() +\r\n  coord_cartesian(clip = \"off\")\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 1: Plot showing annual change in water level (feet above sea level) in Mono Lake from 1850 to 2017. Threshhold water level values impacting bird populations and two key historical events related to changing water levels are noted. Data: Mono Basin Clearinghouse\r\n\r\n\r\n\r\nCitation\r\nMono Basin Clearinghouse, Mono Lake Committee. “Mono Lake Levels 1850-present”. https://www.monobasinresearch.org/data/levelyearly.php. (October 2017).\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-14-mono-lake/mono-lake_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-03-14T12:11:20-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-14-treasure-island/",
    "title": "Text analysis of Robert Louis Stevenson's Treasure Island",
    "description": "Project completed for an assignment in Allison Horst's ESM 244 class.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2021-03-14",
    "categories": [],
    "contents": "\r\nIntroduction\r\nThe following text analysis– with associated Rmarkdown file– explores word frequency trends and conveys the AFINN sentiment score of each chapter of Robert Louis Stevenson’s classic pirate adventure novel, Treasure Island.\r\n\r\n\r\nhide\r\n\r\n#read in Treasure Island by Robert Louis Stevenson\r\n\r\nti <- gutenberg_download(120, mirror = \"http://mirrors.xmission.com/gutenberg/\")\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#trim the text/tidy\r\nti_tidy <- ti %>% \r\n  mutate(text = str_trim(text))\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#remove text outside of chapters in the novel (remove the Part structure), turn chapters into numerics \r\nti_df <- ti_tidy %>% \r\n  slice(-(1:110)) %>% \r\n  mutate(chapter = case_when(\r\n    str_detect(text, \"^[0-9]+$\") ~ text,\r\n    str_detect(text, \"PART[^LY]\") ~ \"PART\",\r\n    TRUE ~ NA_character_)) %>% \r\n  fill(chapter) %>% \r\n  filter(chapter != \"PART\") %>% \r\n  mutate(chapter = as.numeric(chapter))\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#tokenize, remove gb_id\r\nti_tokens <- ti_df %>% \r\n  unnest_tokens(word, text) %>% \r\n  dplyr::select(-gutenberg_id)\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#remove stop words\r\nti_nonstop_words <- ti_tokens %>% \r\n  anti_join(stop_words)\r\n\r\n#word count sans stop words\r\nti_nonstop_counts <- ti_nonstop_words %>% \r\n  count(chapter, word)\r\n\r\n#top 5 words per chapter\r\nti_top_5_words <- ti_nonstop_counts %>% \r\n  group_by(chapter) %>% \r\n  arrange(-n) %>% \r\n  slice(1:5)\r\n\r\n\r\n\r\nTop 5 Words by Chapter\r\nThis analysis looks at the top 5 words for each chapter of Treasure Island to associate any trends… The results were unsurprising, the book is about pirates after all.\r\n\r\n\r\nhide\r\n\r\n#visualize the word counts\r\nggplot(data = ti_top_5_words, aes(x = word, y = n)) +\r\n  geom_col(fill = \"blue\") +\r\n  facet_wrap(~chapter, scales = \"free\") +\r\n  coord_flip() +\r\n  theme_bw()\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 1: Counts of the top 5 most frequently used words in Robert Louis Stevenson’s Treasure Island by chapter.\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n#join sentiment analysis lexicon to TI df\r\nti_afinn <- ti_nonstop_words %>% \r\n  inner_join(get_sentiments(\"afinn\"))\r\n\r\n#get afinn counts for chapter\r\nafinn_counts <- ti_afinn %>% \r\n  count(chapter, value)\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n# Plot them: \r\n#ggplot(data = afinn_counts, aes(x = value, y = n)) +\r\n # geom_col() +\r\n  #facet_wrap(~chapter)\r\n\r\n\r\n\r\nSentiment Analysis using AFINN\r\nI ran the book against the AFINN lexicon to find the mean sentiment scores per chapter. The book is a little on the dark side, especially for a book written primarily for boys.\r\n\r\n\r\nhide\r\n\r\n# Find the mean afinn score by chapter: \r\nafinn_means <- ti_afinn %>% \r\n  group_by(chapter) %>% \r\n  summarize(mean_afinn = mean(value))\r\n\r\n#plot the afinn means\r\nggplot(data = afinn_means, \r\n       aes(x = fct_rev(as.factor(chapter)), y = mean_afinn)) +\r\n  geom_col() +\r\n  labs(y = \"Mean AFINN integer\", x = \"Chapter\") +\r\n  coord_flip() +\r\n  theme_bw()\r\n\r\n\r\n\r\n\r\nFigure 2: Figure 2: Mean sentiment score for each chapter of Robert Louis Stevenson’s Treasure Island based on the AFINN sentiment lexicon. A mean score of -5 is a highly negative sentiment while a mean score of 5 is a highly positive sentiment\r\n\r\n\r\n\r\nWord Cloud\r\nThe final product is a word cloud to present the top 100 words in the novel.\r\n\r\n\r\nhide\r\n\r\n#create subset of top 100 words\r\nti_top100 <- ti_nonstop_words %>%\r\n  count(word) %>% \r\n  arrange(-n) %>% \r\n  slice(1:100)\r\n\r\n# Import image for background\r\nimg.file <- here(\"_posts/2021-03-14-treasure-island/\", \"treasure_island.jpg\")\r\nimg <- readJPEG(img.file)\r\n\r\n#plot it\r\nti_cloud <- ggplot(data = ti_top100, aes(label = word)) +\r\n  background_image(img) +\r\n  geom_text_wordcloud(aes(color = n, size = n), shape = \"circle\") +\r\n  scale_size_area(max_size = 10) +\r\n  scale_color_gradientn(colors = c(\"goldenrod\", \"purple\", \"#660099\")) +\r\n  theme_minimal()\r\n\r\nti_cloud\r\n\r\n\r\n\r\n\r\nCitation\r\nStevenson, R. L. (2006) Treasure Island. Project Gutenberg. [Pdf] Retrieved February 20, 2021, from Project Gutenberg Mirror, http://mirrors.xmission.com/gutenberg/.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-14-treasure-island/treasure-island_files/figure-html5/unnamed-chunk-10-1.png",
    "last_modified": "2021-03-14T11:59:15-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-21-oilspills/",
    "title": "Spatial Analysis of California Oil Spills during 2008",
    "description": "Project completed for an assignment in Allison Horst's ESM 244 class.",
    "author": [
      {
        "name": "Quin Smith",
        "url": {}
      }
    ],
    "date": "2021-02-21",
    "categories": [],
    "contents": "\r\nIntroduction\r\nThis analysis explores reported incidents of oil spills across the State of California in 2008. Data is composed of reports from the California Department of Fish and Wildlife, Office of Spill Prevention and Response (OSPR) Incident Tracking Database (Credits: DFG-OSPR, CalEMA)\r\n\r\nhide\r\n#read in data\r\n\r\n#oil spill data\r\noil_spill <- read_sf(here(\"_posts/2021-02-21-oilspills/oil_spill/\"), layer = \"Oil_Spill_Incident_Tracking_%5Bds394%5D\") %>% \r\n  clean_names()\r\n\r\n#ca counties shapefiles\r\nca_counties <- read_sf(here(\"_posts/2021-02-21-oilspills/ca_counties\"), layer = \"CA_Counties_TIGER2016\") %>% \r\n  clean_names() %>% \r\n  select(name)\r\n\r\n#check projections\r\nst_crs(oil_spill)\r\nst_crs(ca_counties)\r\n\r\n#quick plot\r\n#ggplot() +\r\n # geom_sf(data = ca_counties) +\r\n  #geom_sf(data = oil_spill, aes(color = specificlo))\r\n\r\n\r\n\r\nInteractive map of California oil spills (2008)\r\n\r\nhide\r\n#create interactive tmap\r\ntmap_mode(\"view\")\r\n\r\ntm_shape(oil_spill) +\r\n  tm_dots(\"specificlo\", popup.vars = c(\"localecity\", \"localecoun\"), id = \"oesnumber\", title = \"Spill Environment\", palette = c(\"steelblue2\", \"burlywood\", \"steelblue4\"))\r\n\r\n\r\n\r\n\r\nFigure 1: Interactive map showing the reported oil spills in California during 2008. Color symbology based on the location of the spill. Data: Office of Spill Prevention and Response Incident Tracking Database.\r\n\r\nhide\r\n#create a chloropleth of inland spills\r\n\r\n#subset of ca counties\r\nca_counties_tojoin <- ca_counties %>% \r\n  rename(localecoun = name)\r\n\r\n#subset of inland spill by county\r\ninland_spills <- oil_spill %>% \r\n  filter(inlandmari == \"Inland\") %>% \r\n  count(localecoun) \r\n  \r\n\r\n#join to create the df of the subset by county\r\nca_inland_spills <- ca_counties_tojoin %>% \r\n  st_join(inland_spills)\r\n\r\n\r\n\r\nStatic chloropleth map of California oil spills by county (2008)\r\n\r\nhide\r\n#map the data\r\n#using ggplot\r\n\r\nggplot(data = ca_inland_spills) +\r\n  geom_sf(aes(fill = n), color = \"slategrey\", size = 0.1) +\r\n  scale_fill_gradientn(colors = c(\"lightyellow\",\"orange\",\"tomato4\")) +\r\n  theme_minimal() +\r\n  labs(fill = \"Number of inland oil spills \\nby county\")\r\n\r\n\r\nhide\r\n#using tmap\r\n#tmap_mode(\"plot\")\r\n\r\n#tm_shape(ca_inland_spills) +\r\n  #tm_polygons(col = \"n\", title = \"Number of inland oil spills \\nby County\")\r\n\r\n\r\n\r\nFigure 2: Chloropleth map showing a comparison of reported oil spills between California counties during 2008. Data: Office of Spill Prevention and Response Incident Tracking Database.\r\nData Citation:\r\nCalifornia Department of Fish and Game, Office of Spill Prevention and Response. “Oil Spill Incident Tracking [ds394]” [digital map]. “California State Geoportal”. 2009-07-23 . https://gis.data.ca.gov/datasets/7464e3d6f4924b50ad06e5a553d71086_0/data. (2021-02-20).\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-21-oilspills/oilspills_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2021-02-21T12:36:35-08:00",
    "input_file": {}
  }
]
